Repository: ArcadiaPower/pg_chameleon
Catalog: pg_chameleon/locale/*/LC_MESSAGES/log_msg.po
Languages: it_it

source: Command line for pg_chameleon
it_it: Utilità a linea di comando per pg_chameleon

source: Specifies the configuration to use without the suffix yml. If the parameter is omitted then ~/.pg_chameleon/configuration/default.yml is used.
it_it: Specifica il file di configurazione da usare senza il suffisso yml. Se il parametro viene omesso allora verrà usato il file presente in ~/.pg_chameleon/configuration/default.yml

source: Specifies the schema within a source. If omitted all schemas for the given source are affected by the command. Requires the argument --source to be specified.
it_it: Specifica quale schema usare all'interno del database sorgente. Se omesso tutti gli schemi presenti nel database sorgente sono usati dal comando corrispondente. Richiede che l'argomento --source sia specificato.

source: Specifies the source within a configuration. If omitted all sources are affected by the command.
it_it: Specifica il database sorgente da usare. I'alias della sorgente è impostato nel file di configurazione. Se l'opzione viene omessa tutte le sorgenti definite nella configurazione verranno usate per dal comando.

source: Specifies the tables within a source . If omitted all tables are affected by the command.
it_it: Specifica quali tabelle del database sorgente usare. Se omesso tutte le tabelle verranno usate dal comando.

source: Specifies the log id entry for displaying the error details
it_it: Specifica lo ID di log per visualizzare il dettaglio dell'errore

source: Forces the debug mode with logging on stdout and log level debug
it_it: Abilita la modalità debug con output in console e livello di log debug.

source: Displays pg_chameleon's installed version
it_it: Visualizza la versione installata di pg_chameleon

source: Overrides the level for messages to be sent to rolllbar. One of: "critical", "error", "warning", "info". The Default is "info".
it_it: Override del livello dei messaggi da inviare a rollbar. Accetta uno dei seguenti valori: "critical", "error", "warning", "info". il default è "info".

source: When specified with run_maintenance the switch performs a vacuum full instead of a normal vacuum
it_it: Quanto specificato con il comando run_maintenance questa opzione esegue un VACUUM FULL invece di un VACUUM convenzionale

source: WARNING, entering upgrade mode. Disabling the catalogue version's check. Expected version {expected}, installed version {installed}
it_it: AVVISO, avvio modalitá upgrade. La verifica versione catalogo é disabilitata. Versione attesa {expected}, versione installata {installed}

source: WARNING, catalogue mismatch. Expected version {expected}, installed version {installed}
it_it: ATTENZIONE, versione catalogo incorretta. Versione attesa {expected}, versione installata {installed}

source: FATAL, replica catalogue version mismatch. Expected {expected}, got {installed}
it_it: ERRORE, versione catalogo incorretta. Versione attesa {expected}, versione installata {installed}

source: FATAL, the source {source} is not registered. Please add the source with the command add_source --source {source}
it_it: ERRORE, la sorgente {source} non è registrata. Per aggiungerla usare il comando add_source --source {source}

source: Caught stop replica signal terminating daemons and ending the replica process
it_it: Ricevuto segnale di stop. Arresto dei processi di replica

source: creating directory {directory}
it_it: creazione directory {directory}

source: updating {file}
it_it: il file {file} verrà aggiornato

source: copying {file}
it_it: il file {file} verrà copiato

source: FATAL, configuration file missing. Please ensure the file {file} is present.
it_it: ERRORE, file di configurazione non trovato. Assicurarsi che il file {file} sia presente.

source: Trying to create replica schema
it_it: Creazione catalogo di replica

source: Dropping the replica schema
it_it: Rimozione catalogo di replica

source: FATAL, no source name specified. You must specify a source name with the argument --source
it_it: ERRORE, non è stato specificato un nome sorgente. Per specificarlo usare l'argomento --source

source: Trying to add a new source
it_it: Registrazione nuova sorgente

source: Dropping the source {source} will remove drop any replica reference. Are you sure? YES/No
it_it: La rimozione della sorgente {source} cancellerà tutte le informazioni relative alla replica ad essa associata. Sei sicuro? YES/No

source: Trying to remove the source
it_it: Rimozione sorgente

source: Please type YES all uppercase to confirm
it_it: Per confermare scrivere YES in maiuscolo

source: starting init replica for source {source}
it_it: avviato processo di inizializzazione replica per la sorgente {source}
